app/controllers/admins_controller.rb

INSERT INTO "admins" ("updated_at", "crypted_password", "password_salt", "persistence_token", "login", "created_at") VALUES('2009-06-24 23:46:00', '3b16ad8ea9fd967787df03188a3a35e8c66499d2d6e25788a3898d5fcd44ba116ec4445853c13f40437bd2afddfb745c9ceedef78c79f0b819a417699254af95', 'mP5SBA55WxK25xKnqBcl', '6fc8ca970a2e844d8d420096701b2c80bdeafc6b4d374ecaabe21e42a4985df12ef7abfe1da304dda2a72084fc3c764310820f1c69738e6b19b6a8fdea9e9afc', 'Hillary', '2009-06-24 23:46:00')
---
  def create
    @admin = Admin.new(params[:admin])
    if @admin.save

SELECT * FROM "admins" WHERE ("admins"."id" = 1)
---
  def edit
    @admin = Admin.find(params[:id])