app/controllers/ahas_controller.rb

  def index
    @ahas = Aha.all
---
SELECT * FROM "ahas"

  def create
    @aha = Aha.new(params[:aha])
    if @aha.save
---
INSERT INTO "ahas" ("updated_at", "body", "page_id", "created_at") VALUES('2009-07-22 18:04:50', 'woooeeee!', NULL, '2009-07-22 18:04:50')