app/controllers/faqs_controller.rb

UPDATE "faqs" SET position=1 WHERE (id='6')
---
  def sort
    params[:faqs].each_with_index do |id, index|
      Faq.update_all(['position=?', index+1], ['id=?', id])

SELECT * FROM "faqs" ORDER BY position
---
  def index
    @faqs = Faq.all(:order => "position")

SELECT * FROM "faqs" WHERE ("faqs"."id" = 1)
---
  def show
    @faq = Faq.find(params[:id])

INSERT INTO "faqs" ("updated_at", "title", "body", "position", "created_at") VALUES('2009-07-23 02:20:53', 'Do you offer certification?', '<p>Only if you appear to be a danger to yourself or others.</p>
---
  def create
    @faq = Faq.new(params[:faq])
    if @faq.save

SELECT * FROM "faqs" WHERE ("faqs"."id" = 5)
---
  def edit
    @faq = Faq.find(params[:id])

SELECT * FROM "faqs" WHERE ("faqs"."id" = 5)
UPDATE "faqs" SET "body" = 'Only if you appear to be a danger to yourself or others. We do offer certificates that are good for PDUs, if you''re a Project Manager. If you are seeking Scrum Master certification, we can help with that, too. Give us a shout or check for upcoming classes on our homepage. If you don''t like us, Agile University is the place to go for comprehensive listings of Agile workshops of all kinds.', "updated_at" = '2009-07-23 02:22:11' WHERE "id" = 5
---
  def update
    @faq = Faq.find(params[:id])
    if @faq.update_attributes(params[:faq])

SELECT * FROM "faqs" WHERE ("faqs"."id" = 2)
DELETE FROM "faqs" WHERE "id" = 2
---
  def destroy
    @faq = Faq.find(params[:id])
    @faq.destroy