app/controllers/pages_controller.rb

  def index
    @pages = Page.paginate :per_page => 1, :page => params[:page], :order => 'position'
---
SELECT * FROM "pages" ORDER BY created_at DESC LIMIT 1 OFFSET 0
SELECT count(*) AS count_all FROM "pages"

  def show
    @page = Page.find(params[:id])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 1)

  def create
    @page = Page.new(params[:page])
    if @page.save
---
INSERT INTO "pages" ("visual", "updated_at", "title", "body", "position", "created_at") VALUES('<img src="/images/artichoke.jpg" alt="A lovely artichoke goes here" />', '2009-07-22 01:04:01', 'Who or what is Fibonacci?', 'Fibonacci is a nickname for Leonardo of Pisa, the first westerner to write about the sequence in 1202 A.D. The sequence was known in India long before that.

  def edit
    @page = Page.find(params[:id])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 1)

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(params[:page])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 1)
UPDATE "pages" SET "visual" = '<img src="/images/woz.jpg" alt="A picture of geek coolness" class="photoleft" /><h3>This is Steve Wozniak, one of the coolest geeks ever. Learn your Fibonacci sequences, and you too could end up on <em>Dancing With the Stars!</em></h3>

  def list
    @pages = Page.all(:order => "position")
---
SELECT * FROM "pages" ORDER BY position

  def sort
    params[:pages].each_with_index do |id, index|
      Page.update_all(['position=?', index+1], ['id=?', id])
---
UPDATE "pages" SET position=1 WHERE (id=1)