app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id])
---
SELECT id FROM "questions" WHERE (id > 1) ORDER BY id LIMIT 1