app/controllers/questions_controller.rb

SELECT * FROM "questions" ORDER BY created_at DESC LIMIT 1 OFFSET 0
SELECT count(*) AS count_all FROM "questions"
---
  def index
    @questions = Question.paginate :per_page => 5, :page => params[:page], :order => 'position'

SELECT * FROM "questions" WHERE ("questions"."position" = '3') LIMIT 1
---
  def show
    @question = Question.find_by_position(params[:id])

INSERT INTO "questions" ("updated_at", "qbody", "created_at") VALUES('2009-06-22 23:50:05', 'body of the question.', '2009-06-22 23:50:05')
---
  def create
    @question = Question.new(params[:question])
    if @question.save

SELECT * FROM "questions" WHERE ("questions"."id" = 2)
---
  def edit
    @question = Question.find(params[:id])

SELECT * FROM "questions" WHERE ("questions"."id" = 2)
UPDATE "questions" SET "updated_at" = '2009-06-22 23:55:19', "qbody" = 'another damned bquestion.' WHERE "id" = 2
---
  def update
    @question = Question.find(params[:id])
    if @question.update_attributes(params[:question])

SELECT * FROM "questions" WHERE ("questions"."id" = 1)
DELETE FROM "questions" WHERE "id" = 1
---
  def destroy
    @question = Question.find(params[:id])
    @question.destroy

SELECT * FROM "questions" WHERE ("questions"."position" IS NULL) LIMIT 1
SELECT * FROM "answers" WHERE ("answers"."id" = 6)
---
  def add_to_scorecard
    question = Question.find_by_position(params[:id])
    answer = Answer.find(params[:answer])

UPDATE "questions" SET position=1 WHERE (id='1')
---
  def sort
    params[:questions].each_with_index do |id, index|
      Question.update_all(['position=?', index+1], ['id=?', id])